tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "bash"
brew "git"
brew "autoconf"
brew "xz"
brew "awscli"
brew "libidn2"
brew "exiftool"
brew "fish"
brew "unixodbc"
brew "git-flow"
brew "httpd", restart_service: true
brew "jq"
brew "libusb-compat"
brew "mogenerator"
brew "mysql@5.7", restart_service: true
brew "node"
brew "php@7.2"
brew "python@3.7"
brew "rbenv"
brew "swiftformat"
brew "terminal-notifier"
brew "uncrustify"
brew "virtualenv"
brew "wget"
